writeup/results.tex
% Created 2020-09-25 Fri 14:56
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Max Fan}
\date{\today}
\title{Housing Allocation Optimization}
\hypersetup{
 pdfauthor={Max Fan},
 pdftitle={Housing Allocation Optimization},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.7)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Motivations}
\label{sec:org47c1139}
Traditionally, housing allocation at Choate Rosemary Hall was done by hand.
Decades ago, this process was done through a lottery, with students randomly selecting numbers out of a hat.
The students would be allocated to the house of their choosing in the ordering of the numbers they received.
This system was later amended to allow for more flexibility, giving Choate students the system, they have today -- a "random" lottery that takes into account everyone's preferences and priorities.

The optimization techniques available have drastically improved since the 20th century.
It is now feasible for normal laptops to churn through hundreds of thousands of possibilities per second.
In addition to the computational leaps made within the past century, there has been great development in the theory of optimization and resource allocation.
We aim to examine and develop several optimization techniques that can take advantage of these recent developments.

\section{Introduction}
\label{sec:orgc44ba09}

\subsection{The Deans' Algorithm}
\label{sec:orgea12a01}

\subsection{MCMC}
\label{sec:orga95e088}

\subsection{Constraint Solvers}
\label{sec:org640dd4f}

\section{Methodology}
\label{sec:orgc0ba115}

\section{Results}
\label{sec:org9690729}

\section{Conclusion}
\label{sec:orgb6da137}
\end{document}